[
	{
		"PointName": "Northpoint",
		"Info": "<div> <h3> First Era </h3> <p> Captain Yric Flowdys was an enterprising Breton trader that operated the summer trade route between Daggerfall and Solitude in the Sea of Ghosts. Flowdys had an eye for the geography around modern day Northpoint and established a trade port in the 9th Century of the First Era. He that the deep waters near the shoreline was perfect for large vessels and that the general location would make a perfect waypoint between the two cities. Flowdys created the first docks at Northpoint and eventually named the city after it. </p> <p> After building the docks, Flowdys came up with the idea to build a small walled keep and a warehouse on the Dore Elard heights east of the docks. Sometime later, Flowdys little hamlet was bustling with people and Flowdys changed his last name to Dorell, after Dore Elard. House Dorell took an interest in investing in ports and surrounding lands. They eventually leased plots of land to local farms and found a new source of income in Northpoint. </p> <p>In 1E 1029, House Dorell was granted a barony by Empress Hestra when High Rock joined the Empire of Cyrodiil. Northpoint waxed and waned the flow of northwest coastal trade ever since. In the 24th century of the First Era, House Dorell occupied Shornhelm for few generations. The current ruler of House Dorell would reside in the family mansion in Shornhelm, other family members would be given the family mansion in Northpoint. House Dorell considers themselves as Rivenspires true elite even to this day. </p> <h3> Second Era </h3> <p> In 2E 582, the current ruler of House Dorell is Baron Alard Dorell. Like the leaders of House Montclair and House Tamrith, Alard considers himself High King and desires to be the sole ruler of Shornhelm after former king Ranser. Even though leaders of House Dorell stay in Shornhelm, land surrounding Northpoint is integral to Dorell. Lord Ellic Dorell resides at Dorell Manor in Northpoint and manages the land and income coming from Northpoint. </p> <p> After the tragic death of Baroness Leila Montclair atop The Doomcrag Spire, Baron Wylon Montclair seeked his vengeance by taking the entire Rivenspire region by force. After the death of Reezal-Jul, Lady Lleraya Montclair manipulated Ellic Dorell and took control over the city of Northpoint. All the gates leading into Northpoint were locked up and the city guard was thrown out of the city. With the help of the Vestige, the Daggerfall Covenant entered the city through the underground tunnels connected to the city lighthouse. The Vestige eventually fought their way to Dorell Manor and killed Lleraya in Ellics throne room. Because of letting Northpoint being under Llerayas control, Alard stripped Ellic of his title of ruler of Northpoint. </p> <h3> Third Era </h3> <p> During the Imperial Simulacrum, the Eternal Champion had at one point visited the city in their quest for a piece of the Staff of Chaos. </p> <p> The cities of Northpoint and Evermore were not affected by the Warp in the West but instead took advantage of it. Both cities annexed several smaller nations to a certain extent. Far west to avoid issues with Skyrim and the War of Bendr-Mahk and far north to not bring attention from Daggerfall and Wayrest. </p> </div>"
	}
]